# InvalidSkipSegments Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainWallFailures..::..InvalidSkipSegments Property
BuiltInFailures..::..CurtainWallFailures Class See Also
---
A curtain grid line had invalid removed segment data. When correcting data, Revit may have split curtain panels that should be combined.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidSkipSegments { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidSkipSegments As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidSkipSegments {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainWallFailures Class
Autodesk.Revit.DB Namespace